
# bool - логический тип данных
# print(True , False)



# условие
# условие принимает только bool
if(False):
    print("hello ok")

print("text")



# num_bool = False
# if(num_bool):
#     print("num_bool = True")



# num = 2
# print(2 == num)

# if(2 == num):
#     print("ok")



# Логические операторы:
# print("2 == 2 =" , 2 == 2)
# print("2 != 2 =" , 2 != 2)
# print("1 < 2 =" , 1 < 2)
# print("2 > 2 =" , 2 > 2)
# print("2 <= 2 =" , 2 <= 2)
# print("2 >= 2 =" , 2 >= 2)



# пример с логическим оператором
# num_2 = int(input("++="))
# if(num_2 <= 10):
#     print("ok")




# num_pass_1 = input("++=")
# if(num_pass_1 == "123s"):
#     print("пароль ok")

# print("пароль not")



# else - иначе
# num_pass_2 = input("++=")
# if(num_pass_2 == "123s"):
#     print("пароль ok")
# else:
#     print("пароль not")

# print("end --==")




# условный операторй and
# print("--- and ---")
# print("True and True =" , True and True)
# print("True and False =" , True and False)
# print("False and False =" , False and False)


# условный операторй or
# print("--- or ---")
# print("True or True =" , True or True)
# print("True or False =" , True or False)
# print("False or False =" , False or False)



# работа с условным оператором
# num_3 = int(input("++="))
# if(num_3<10 or num_3 == 16):
#     print("ok")




print((True or False) and (True or False))






# дз
# Задание 1. Пльзователь вводит число. Определить, является ли оно четным.

# Задание 2. Пользователь вводит два числа. Вывести на 
# экран меньшее из этих чисел. 

# Задание 3. Пользователь вводит число. Определить, положительное это число, отрицательное или равно нулю.

# Задание 4. Пользователь вводит два числа. Определить, 
# равны ли эти числа, и если нет, вывести их на экран в порядке возрастания

# Задание 5. Пользователь с клавиатуры вводит 5 оценок 
# студента. Определить, допущен ли студент к экзамену. 
# Студент получает допуск, если его средний балл 3 балла 
# и выше.

# Задание 6. Пользователь вводит с клавиатуры число. Если 
# оно четное, умножить его на три, иначе — поделить на 
# два. Результат вывести на экран.





