
# скобки
# num = (2 + 2) * 3
# print(num)



# print("10 / 3 =" , 10 / 3) #Деление
# print("10 // 3 =" , 10 // 3) #деление без остатка 
# print("10 % 3 =" , 10 % 3) #остаток от деления



# сложение строки
# num_2 = "qwerty="
# print(num_2 + num_2 , "asd" + "," + "b nkk")



# умножение строки
# print(num_2 * 4)
# print("123" * 3)



# тип переменной
# num_3 = 8
# print(type(num_3))
# print(type(2.5))

# num_4_t = type(None)
# print(num_4_t)


# типы данных
# print("type(2) =" , type(2)) # int - Целые числа
# print("type(1.9) =" , type(1.9)) # float - Числа с плавающей точкой
# print("type('t') =" , type("t")) # str - Строка
# print("type(True) =" , type(True)) # boot - Логические значения
# print("type(None) =" , type(None)) # NoneType - Ничего





# num_5 = "5"
# print(num_5 * 3)
# print(type(num_5))

# преобразование строки в число 
# num_t_int = int(num_5)

# print(num_t_int)
# print(num_t_int * 3)
# print(type(num_t_int))





# num_6 = 6.8
# print(num_6)
# print(type(num_6))

# преобразование float в int
# num_6 = int(num_6)
# print("=========")

# print(num_6)
# print(type(num_6))



# num_7 = 4
# print(num_7)
# print(type(num_7))

# преобразование int в float
# num_7 = float(num_7)
# print("=========")

# print(num_7)
# print(type(num_7))




# num_8 = 3
# print(num_8)
# print(num_8 * 6)
# print(type(num_8))

# преобразование числа в строку 
# num_8 = str(num_8)
# print("=========")

# print(num_8)
# print(num_8 * 6)
# print(type(num_8))



# int и float работает только с числами иначе ошибка
# print(int("12z"))



# ввод данных
# num_inp = input("__")
# num_inp = int(num_inp)
# print(type(num_inp))



# ввод данных и преобразование в число
# num_inp_2 = int(input("__"))
# print(type(num_inp_2))



# input() - возвращает строку
# print(input("inp_1==") + "_!_"+ input("inp_2=="))


# вывод символа из строки
# num_str_9 = "qwerty"
# print(num_str_9[0] , num_str_9[4])


# print("123456"[3])


# num_str_10 = "qwerty"

# из симбволов можно создавать новую строку
# num_str_11 = num_str_10[1] + num_str_10[5] + "-asd"

# print(num_str_11)



# пробел тоже символ
# num_str_12 = "f g"
# print(num_str_12[0] , num_str_12[1])




# задача 1
# Написать программу вычисления расстояния 
# между двумя точками.

# Задание 2
# Написать программу вычисления объема параллелепипеда. Ниже приведен рекомендуемый вид экрана 
# во время выполнения программы.
# Вычисление объема параллелепипеда.
# Введите исходные данные:
# Длина (см) -> 9;
# Ширина (см) -> 7.5;
# Высота (см) -> 5;
# Объем: 337.50 куб. см.

# Задание 3
# Зарплата менеджера — 100$ + 5% от продаж. 
# Пользователь вводит с клавиатуры общую сумму сделок менеджера за месяц. 
# Посчитать итоговую зарплату менеджера.

# задача 4 
# Пользователь вводит с клавиатуры денежную 
# сумму в рублях и копейках (рубли и копейки вводятся 
# в разные переменные). Сумма может быть введена как 
# правильно (например 19 руб. 90 коп), так и неправильно 
# (например 22 руб. 978 коп). Написать программу, которая, 
# используя только линейный алгоритм, осуществит корректировку введенной денежной суммы в правильную форму.
# Например, если пользователь ввел 11 руб. 150 коп, 
# программа должна вывести на экран сумму 12 руб. 50 копю

# задача 5
# Пользователь вводит с клавиатуры время 
# в секундах, прошедшее с начала дня. Вывести на экран 
# текущее время в часах, минутах и секундах. Посчитать, 
# сколько часов, минут и секунд осталось до полуночию