
# вывод дынных
# print("hello world")
# print('hello red')
# print(20)



# # создание и вывод переменной
# num = 4
# print(num)



# точка и запятая в python
# print(7.4)
# print(7 , 4 , "eyfgefy" , "ehhehe" , num)



# арифметические операторы
# print("3 + 2 =" , 3 + 2) # Сумма
# print("3 - 2 =" , 3 - 2) # Вычитание
# print("3 * 3 =" , 3 * 3) # Умножение
# print("3 ** 3 =" , 3 ** 3) # Возведение в степень
# print("10 / 3 =" , 10 / 3) # Деление
# print("10 // 3 =" , 10 // 3) #деление без остатка 
# print("10 % 3 =" , 10 % 3) #остаток от деления



# пример названия переменных
# red_car = 0
# redCarSpeed = 0
# q1wer4ty9 = 3



# перезапись переменной 
# num_2 = 6
# print(num_2)
# num_2 = 4
# print(num_2)



# изменение переменной 
# num_2 = num_2 + 8
# print(num_2)



# типы данных
# num_int = 8 # int - Целые числа
# num_float = 4.2 # float - Числа с плавающей точкой
# num_str = "qwerty" # str - Строка
# num_bool = False # boot - Логические значения
# num_null = None # NoneType - Ничего

# print("num_int =" , num_int)
# print("num_float =" , num_float)
# print("num_str =" , num_str)
# print("num_bool =" , num_bool)
# print("num_null =" , num_null)



# пример использование None
# num_3 = None
# print(num_3)
# num_3 = "hello"
# print(num_3)






# dz
# задача 1
# Дана диагональ телевизора в дюймах. Написать программу, определяющую эту же диагональ в сантиметрах 
# (1 дюйм = 2.54 сантиметров).

# задача 2
# Емкость аккумулятора смартфона составляет N мАч. 
# Написать программу, определяющую минимальную 
# емкость переносного зарядного устройства (powerbank), 
# если необходимо 3 полных заряда смартфона.

# задача 3
# За один день хомячок съедает K грамм корма. 
# Написать программу, определяющую закупку корма в килограммах на 30 дней.

# задача 4 
# Пользователь вводит с клавиатуры денежную 
# сумму в рублях и копейках (рубли и копейки вводятся 
# в разные переменные). Сумма может быть введена как 
# правильно (например 19 руб. 90 коп), так и неправильно 
# (например 22 руб. 978 коп). Написать программу, которая, 
# используя только линейный алгоритм, осуществит корректировку введенной денежной суммы в правильную форму.
# Например, если пользователь ввел 11 руб. 150 коп, 
# программа должна вывести на экран сумму 12 руб. 50 копю

# задача 5
# Пользователь вводит с клавиатуры время 
# в секундах, прошедшее с начала дня. Вывести на экран 
# текущее время в часах, минутах и секундах. Посчитать, 
# сколько часов, минут и секунд осталось до полуночию

# задача 6
# Пользователь вводит с клавиатуры три числа. 
# Посчитать их сумму, произведение и среднее арифметическое.



